#!/usr/bin/env python
# -*- coding: utf-8 -*-
from typing import List


# 堆箱子。给你一堆n个箱子，箱子宽 wi、深 di、高 hi。箱子不能翻转，将箱子堆起来时，下面箱子的宽度、高度和深度必须大于上面的箱子。实现一种方法，搭出最
# 高的一堆箱子。箱堆的高度为每个箱子高度的总和。
#
#  输入使用数组[wi, di, hi]表示每个箱子。
#
#  示例1:
#
#   输入：box = [[1, 1, 1], [2, 2, 2], [3, 3, 3]]
#  输出：6
#
#
#  示例2:
#
#   输入：box = [[1, 1, 1], [2, 3, 4], [2, 6, 7], [3, 4, 5]]
#  输出：10
#
#
#  提示:
#
#
#  箱子的数目不大于3000个。
#
#  Related Topics 数组 动态规划 排序
#  👍 48 👎 0


class Solution:
    def pileBox(self, box: List[List[int]]) -> int:
        if not box:
            return 0
        box.sort()
        n = len(box)
        dp = [0] * n
        # dp[0]=box[0][2]
        for i in range(n):
            dp[i] = box[i][2]
            for j in range(i):
                if box[i][0] > box[j][0] and box[i][1] > box[j][1] and box[i][2] > box[j][2]:
                    dp[i] = max(dp[j] + box[i][2], dp[i])
        return max(dp)